<?php

// Задача 64: Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.
// M = 1; N = 5. -> ""1, 2, 3, 4, 5""
// M = 4; N = 8. -> ""4, 6, 7, 8""

$m = 1;
$n = 5;

for ($i = $m; $i <= $n; $i++) {
    echo $i . ", ";
}



$M = 3;
$N = 15;

for ($i = $M; $i <= $N; $i++) {
    echo $i . " "; // 3 4 5 6 7 8 9 10 11 12 13 14 15
}

$M = 2;
$N = 24;

while ($M <= $N) {
    echo $M . " "; // 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
    $M++;
}


// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30

$M = 1;
$N = 15;
$sum = 0;

for ($i = $M; $i <= $N; $i++) {
    $sum += $i;
}

echo $sum; // 120

$M = 4;
$N = 8;
$sum = 0;
$i = $M;

while ($i <= $N) {
    $sum += $i;
    $i++;
}

echo $sum; // 30

$M = 5;
$N = 30;

$arr = range($M, $N);
$sum = array_sum($arr);

echo $sum; // 475


// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 9

function ack($m, $n)
{
    if ($m == 0) {
        return $n + 1;
    } else if ($n == 0) {
        return ack($m - 1, 1);
    } else {
        return ack($m - 1, ack($m, $n - 1));
    }
}

$m = 2;
$n = 3;

$result = ack($m, $n);
echo "A($m, $n) = $result"; // A(2, 3) = 9

$m = 2;
$n = 3;

while ($m != 0) {
    if ($n == 0) {
        $n = 1;
    } else {
        $n = ack($m, $n - 1);
    }
    $m -= 1;
}

$result = $n + 1;
echo "A($m, $n) = $result"; //A(2, 3) = 9
